layer {
  name: "data"
  type: "AnnotatedData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    mean_value: 130.0
    mean_value: 127.0
    mean_value: 125.0
    resize_param {
      prob: 1.0
      resize_mode: WARP
      height: 300
      width: 510
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: NEAREST
      interp_mode: CUBIC
      interp_mode: LANCZOS4
    }
    emit_constraint {
      emit_type: CENTER
    }
    distort_param {
      brightness_prob: 0.5
      brightness_delta: 32.0
      contrast_prob: 0.5
      contrast_lower: 0.5
      contrast_upper: 1.5
      hue_prob: 0.5
      hue_delta: 18.0
      saturation_prob: 0.5
      saturation_lower: 0.5
      saturation_upper: 1.5
      random_order_prob: 0.0
    }
    expand_param {
      prob: 0.5
      max_expand_ratio: 4.0
    }
  }
  data_param {
    source: "examples/GTSDB/GTSDB_trainval_lmdb"
    batch_size: 2
    backend: LMDB
  }
  annotated_data_param {
    batch_sampler {
      max_sample: 1
      max_trials: 1
    }
    batch_sampler {
      sampler {
        min_scale: 0.30000001192092896
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.10000000149011612
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.30000001192092896
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.30000001192092896
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.30000001192092896
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.5
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.30000001192092896
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.699999988079071
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.30000001192092896
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.8999999761581421
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.30000001192092896
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        max_jaccard_overlap: 1.0
      }
      max_sample: 1
      max_trials: 50
    }
    label_map_file: "data/GTSDB/labelmap_GTSDB.prototxt"
  }
}
layer {
  name: "conv"
  type: "Convolution"
  bottom: "data"
  top: "conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "conv_bn"
  type: "BatchNorm"
  bottom: "conv"
  top: "conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "conv_bias"
  type: "Bias"
  bottom: "conv"
  top: "conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv_relu"
  type: "ReLU"
  bottom: "conv"
  top: "conv"
}
layer {
  name: "conv_1"
  type: "Convolution"
  bottom: "conv"
  top: "conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "conv_1_bn"
  type: "BatchNorm"
  bottom: "conv_1"
  top: "conv_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "conv_1_bias"
  type: "Bias"
  bottom: "conv_1"
  top: "conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv_1_relu"
  type: "ReLU"
  bottom: "conv_1"
  top: "conv_1"
}
layer {
  name: "conv_2"
  type: "Convolution"
  bottom: "conv_1"
  top: "conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "conv_2_bn"
  type: "BatchNorm"
  bottom: "conv_2"
  top: "conv_2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "conv_2_bias"
  type: "Bias"
  bottom: "conv_2"
  top: "conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv_2_relu"
  type: "ReLU"
  bottom: "conv_2"
  top: "conv_2"
}
layer {
  name: "pool"
  type: "Pooling"
  bottom: "conv_2"
  top: "pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "conv_3"
  type: "Convolution"
  bottom: "pool"
  top: "conv_3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 80
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "conv_3_bn"
  type: "BatchNorm"
  bottom: "conv_3"
  top: "conv_3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "conv_3_bias"
  type: "Bias"
  bottom: "conv_3"
  top: "conv_3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv_3_relu"
  type: "ReLU"
  bottom: "conv_3"
  top: "conv_3"
}
layer {
  name: "conv_4"
  type: "Convolution"
  bottom: "conv_3"
  top: "conv_4"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "conv_4_bn"
  type: "BatchNorm"
  bottom: "conv_4"
  top: "conv_4"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "conv_4_bias"
  type: "Bias"
  bottom: "conv_4"
  top: "conv_4"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "conv_4_relu"
  type: "ReLU"
  bottom: "conv_4"
  top: "conv_4"
}
layer {
  name: "pool_1"
  type: "Pooling"
  bottom: "conv_4"
  top: "pool_1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "mixed/conv"
  type: "Convolution"
  bottom: "pool_1"
  top: "mixed/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed/conv_bn"
  type: "BatchNorm"
  bottom: "mixed/conv"
  top: "mixed/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed/conv_bias"
  type: "Bias"
  bottom: "mixed/conv"
  top: "mixed/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed/conv_relu"
  type: "ReLU"
  bottom: "mixed/conv"
  top: "mixed/conv"
}
layer {
  name: "mixed/tower/conv"
  type: "Convolution"
  bottom: "pool_1"
  top: "mixed/tower/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed/tower/conv_bn"
  type: "BatchNorm"
  bottom: "mixed/tower/conv"
  top: "mixed/tower/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed/tower/conv_bias"
  type: "Bias"
  bottom: "mixed/tower/conv"
  top: "mixed/tower/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed/tower/conv_relu"
  type: "ReLU"
  bottom: "mixed/tower/conv"
  top: "mixed/tower/conv"
}
layer {
  name: "mixed/tower/conv_1"
  type: "Convolution"
  bottom: "mixed/tower/conv"
  top: "mixed/tower/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed/tower/conv_1_bn"
  type: "BatchNorm"
  bottom: "mixed/tower/conv_1"
  top: "mixed/tower/conv_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed/tower/conv_1_bias"
  type: "Bias"
  bottom: "mixed/tower/conv_1"
  top: "mixed/tower/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed/tower/conv_1_relu"
  type: "ReLU"
  bottom: "mixed/tower/conv_1"
  top: "mixed/tower/conv_1"
}
layer {
  name: "mixed/tower_1/conv"
  type: "Convolution"
  bottom: "pool_1"
  top: "mixed/tower_1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed/tower_1/conv_bn"
  type: "BatchNorm"
  bottom: "mixed/tower_1/conv"
  top: "mixed/tower_1/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed/tower_1/conv_bias"
  type: "Bias"
  bottom: "mixed/tower_1/conv"
  top: "mixed/tower_1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed/tower_1/conv_relu"
  type: "ReLU"
  bottom: "mixed/tower_1/conv"
  top: "mixed/tower_1/conv"
}
layer {
  name: "mixed/tower_1/conv_1"
  type: "Convolution"
  bottom: "mixed/tower_1/conv"
  top: "mixed/tower_1/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed/tower_1/conv_1_bn"
  type: "BatchNorm"
  bottom: "mixed/tower_1/conv_1"
  top: "mixed/tower_1/conv_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed/tower_1/conv_1_bias"
  type: "Bias"
  bottom: "mixed/tower_1/conv_1"
  top: "mixed/tower_1/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed/tower_1/conv_1_relu"
  type: "ReLU"
  bottom: "mixed/tower_1/conv_1"
  top: "mixed/tower_1/conv_1"
}
layer {
  name: "mixed/tower_1/conv_2"
  type: "Convolution"
  bottom: "mixed/tower_1/conv_1"
  top: "mixed/tower_1/conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed/tower_1/conv_2_bn"
  type: "BatchNorm"
  bottom: "mixed/tower_1/conv_2"
  top: "mixed/tower_1/conv_2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed/tower_1/conv_2_bias"
  type: "Bias"
  bottom: "mixed/tower_1/conv_2"
  top: "mixed/tower_1/conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed/tower_1/conv_2_relu"
  type: "ReLU"
  bottom: "mixed/tower_1/conv_2"
  top: "mixed/tower_1/conv_2"
}
layer {
  name: "mixed/tower_2/pool"
  type: "Pooling"
  bottom: "pool_1"
  top: "mixed/tower_2/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "mixed/tower_2/conv"
  type: "Convolution"
  bottom: "mixed/tower_2/pool"
  top: "mixed/tower_2/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed/tower_2/conv_bn"
  type: "BatchNorm"
  bottom: "mixed/tower_2/conv"
  top: "mixed/tower_2/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed/tower_2/conv_bias"
  type: "Bias"
  bottom: "mixed/tower_2/conv"
  top: "mixed/tower_2/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed/tower_2/conv_relu"
  type: "ReLU"
  bottom: "mixed/tower_2/conv"
  top: "mixed/tower_2/conv"
}
layer {
  name: "mixed/join"
  type: "Concat"
  bottom: "mixed/conv"
  bottom: "mixed/tower/conv_1"
  bottom: "mixed/tower_1/conv_2"
  bottom: "mixed/tower_2/conv"
  top: "mixed/join"
  concat_param {
    axis: 1
  }
}
layer {
  name: "mixed_1/conv"
  type: "Convolution"
  bottom: "mixed/join"
  top: "mixed_1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_1/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_1/conv"
  top: "mixed_1/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_1/conv_bias"
  type: "Bias"
  bottom: "mixed_1/conv"
  top: "mixed_1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_1/conv_relu"
  type: "ReLU"
  bottom: "mixed_1/conv"
  top: "mixed_1/conv"
}
layer {
  name: "mixed_1/tower/conv"
  type: "Convolution"
  bottom: "mixed/join"
  top: "mixed_1/tower/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_1/tower/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_1/tower/conv"
  top: "mixed_1/tower/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_1/tower/conv_bias"
  type: "Bias"
  bottom: "mixed_1/tower/conv"
  top: "mixed_1/tower/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_1/tower/conv_relu"
  type: "ReLU"
  bottom: "mixed_1/tower/conv"
  top: "mixed_1/tower/conv"
}
layer {
  name: "mixed_1/tower/conv_1"
  type: "Convolution"
  bottom: "mixed_1/tower/conv"
  top: "mixed_1/tower/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_1/tower/conv_1_bn"
  type: "BatchNorm"
  bottom: "mixed_1/tower/conv_1"
  top: "mixed_1/tower/conv_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_1/tower/conv_1_bias"
  type: "Bias"
  bottom: "mixed_1/tower/conv_1"
  top: "mixed_1/tower/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_1/tower/conv_1_relu"
  type: "ReLU"
  bottom: "mixed_1/tower/conv_1"
  top: "mixed_1/tower/conv_1"
}
layer {
  name: "mixed_1/tower_1/conv"
  type: "Convolution"
  bottom: "mixed/join"
  top: "mixed_1/tower_1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_1/tower_1/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_1/tower_1/conv"
  top: "mixed_1/tower_1/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_1/tower_1/conv_bias"
  type: "Bias"
  bottom: "mixed_1/tower_1/conv"
  top: "mixed_1/tower_1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_1/tower_1/conv_relu"
  type: "ReLU"
  bottom: "mixed_1/tower_1/conv"
  top: "mixed_1/tower_1/conv"
}
layer {
  name: "mixed_1/tower_1/conv_1"
  type: "Convolution"
  bottom: "mixed_1/tower_1/conv"
  top: "mixed_1/tower_1/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_1/tower_1/conv_1_bn"
  type: "BatchNorm"
  bottom: "mixed_1/tower_1/conv_1"
  top: "mixed_1/tower_1/conv_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_1/tower_1/conv_1_bias"
  type: "Bias"
  bottom: "mixed_1/tower_1/conv_1"
  top: "mixed_1/tower_1/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_1/tower_1/conv_1_relu"
  type: "ReLU"
  bottom: "mixed_1/tower_1/conv_1"
  top: "mixed_1/tower_1/conv_1"
}
layer {
  name: "mixed_1/tower_1/conv_2"
  type: "Convolution"
  bottom: "mixed_1/tower_1/conv_1"
  top: "mixed_1/tower_1/conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_1/tower_1/conv_2_bn"
  type: "BatchNorm"
  bottom: "mixed_1/tower_1/conv_2"
  top: "mixed_1/tower_1/conv_2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_1/tower_1/conv_2_bias"
  type: "Bias"
  bottom: "mixed_1/tower_1/conv_2"
  top: "mixed_1/tower_1/conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_1/tower_1/conv_2_relu"
  type: "ReLU"
  bottom: "mixed_1/tower_1/conv_2"
  top: "mixed_1/tower_1/conv_2"
}
layer {
  name: "mixed_1/tower_2/pool"
  type: "Pooling"
  bottom: "mixed/join"
  top: "mixed_1/tower_2/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "mixed_1/tower_2/conv"
  type: "Convolution"
  bottom: "mixed_1/tower_2/pool"
  top: "mixed_1/tower_2/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_1/tower_2/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_1/tower_2/conv"
  top: "mixed_1/tower_2/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_1/tower_2/conv_bias"
  type: "Bias"
  bottom: "mixed_1/tower_2/conv"
  top: "mixed_1/tower_2/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_1/tower_2/conv_relu"
  type: "ReLU"
  bottom: "mixed_1/tower_2/conv"
  top: "mixed_1/tower_2/conv"
}
layer {
  name: "mixed_1/join"
  type: "Concat"
  bottom: "mixed_1/conv"
  bottom: "mixed_1/tower/conv_1"
  bottom: "mixed_1/tower_1/conv_2"
  bottom: "mixed_1/tower_2/conv"
  top: "mixed_1/join"
  concat_param {
    axis: 1
  }
}
layer {
  name: "mixed_2/conv"
  type: "Convolution"
  bottom: "mixed_1/join"
  top: "mixed_2/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_2/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_2/conv"
  top: "mixed_2/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_2/conv_bias"
  type: "Bias"
  bottom: "mixed_2/conv"
  top: "mixed_2/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_2/conv_relu"
  type: "ReLU"
  bottom: "mixed_2/conv"
  top: "mixed_2/conv"
}
layer {
  name: "mixed_2/tower/conv"
  type: "Convolution"
  bottom: "mixed_1/join"
  top: "mixed_2/tower/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 48
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_2/tower/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_2/tower/conv"
  top: "mixed_2/tower/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_2/tower/conv_bias"
  type: "Bias"
  bottom: "mixed_2/tower/conv"
  top: "mixed_2/tower/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_2/tower/conv_relu"
  type: "ReLU"
  bottom: "mixed_2/tower/conv"
  top: "mixed_2/tower/conv"
}
layer {
  name: "mixed_2/tower/conv_1"
  type: "Convolution"
  bottom: "mixed_2/tower/conv"
  top: "mixed_2/tower/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_2/tower/conv_1_bn"
  type: "BatchNorm"
  bottom: "mixed_2/tower/conv_1"
  top: "mixed_2/tower/conv_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_2/tower/conv_1_bias"
  type: "Bias"
  bottom: "mixed_2/tower/conv_1"
  top: "mixed_2/tower/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_2/tower/conv_1_relu"
  type: "ReLU"
  bottom: "mixed_2/tower/conv_1"
  top: "mixed_2/tower/conv_1"
}
layer {
  name: "mixed_2/tower_1/conv"
  type: "Convolution"
  bottom: "mixed_1/join"
  top: "mixed_2/tower_1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_2/tower_1/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_2/tower_1/conv"
  top: "mixed_2/tower_1/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_2/tower_1/conv_bias"
  type: "Bias"
  bottom: "mixed_2/tower_1/conv"
  top: "mixed_2/tower_1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_2/tower_1/conv_relu"
  type: "ReLU"
  bottom: "mixed_2/tower_1/conv"
  top: "mixed_2/tower_1/conv"
}
layer {
  name: "mixed_2/tower_1/conv_1"
  type: "Convolution"
  bottom: "mixed_2/tower_1/conv"
  top: "mixed_2/tower_1/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_2/tower_1/conv_1_bn"
  type: "BatchNorm"
  bottom: "mixed_2/tower_1/conv_1"
  top: "mixed_2/tower_1/conv_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_2/tower_1/conv_1_bias"
  type: "Bias"
  bottom: "mixed_2/tower_1/conv_1"
  top: "mixed_2/tower_1/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_2/tower_1/conv_1_relu"
  type: "ReLU"
  bottom: "mixed_2/tower_1/conv_1"
  top: "mixed_2/tower_1/conv_1"
}
layer {
  name: "mixed_2/tower_1/conv_2"
  type: "Convolution"
  bottom: "mixed_2/tower_1/conv_1"
  top: "mixed_2/tower_1/conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_2/tower_1/conv_2_bn"
  type: "BatchNorm"
  bottom: "mixed_2/tower_1/conv_2"
  top: "mixed_2/tower_1/conv_2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_2/tower_1/conv_2_bias"
  type: "Bias"
  bottom: "mixed_2/tower_1/conv_2"
  top: "mixed_2/tower_1/conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_2/tower_1/conv_2_relu"
  type: "ReLU"
  bottom: "mixed_2/tower_1/conv_2"
  top: "mixed_2/tower_1/conv_2"
}
layer {
  name: "mixed_2/tower_2/pool"
  type: "Pooling"
  bottom: "mixed_1/join"
  top: "mixed_2/tower_2/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "mixed_2/tower_2/conv"
  type: "Convolution"
  bottom: "mixed_2/tower_2/pool"
  top: "mixed_2/tower_2/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_2/tower_2/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_2/tower_2/conv"
  top: "mixed_2/tower_2/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_2/tower_2/conv_bias"
  type: "Bias"
  bottom: "mixed_2/tower_2/conv"
  top: "mixed_2/tower_2/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_2/tower_2/conv_relu"
  type: "ReLU"
  bottom: "mixed_2/tower_2/conv"
  top: "mixed_2/tower_2/conv"
}
layer {
  name: "mixed_2/join"
  type: "Concat"
  bottom: "mixed_2/conv"
  bottom: "mixed_2/tower/conv_1"
  bottom: "mixed_2/tower_1/conv_2"
  bottom: "mixed_2/tower_2/conv"
  top: "mixed_2/join"
  concat_param {
    axis: 1
  }
}
layer {
  name: "mixed_3/conv"
  type: "Convolution"
  bottom: "mixed_2/join"
  top: "mixed_3/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 384
    bias_term: false
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_3/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_3/conv"
  top: "mixed_3/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_3/conv_bias"
  type: "Bias"
  bottom: "mixed_3/conv"
  top: "mixed_3/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_3/conv_relu"
  type: "ReLU"
  bottom: "mixed_3/conv"
  top: "mixed_3/conv"
}
layer {
  name: "mixed_3/tower/conv"
  type: "Convolution"
  bottom: "mixed_2/join"
  top: "mixed_3/tower/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_3/tower/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_3/tower/conv"
  top: "mixed_3/tower/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_3/tower/conv_bias"
  type: "Bias"
  bottom: "mixed_3/tower/conv"
  top: "mixed_3/tower/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_3/tower/conv_relu"
  type: "ReLU"
  bottom: "mixed_3/tower/conv"
  top: "mixed_3/tower/conv"
}
layer {
  name: "mixed_3/tower/conv_1"
  type: "Convolution"
  bottom: "mixed_3/tower/conv"
  top: "mixed_3/tower/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_3/tower/conv_1_bn"
  type: "BatchNorm"
  bottom: "mixed_3/tower/conv_1"
  top: "mixed_3/tower/conv_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_3/tower/conv_1_bias"
  type: "Bias"
  bottom: "mixed_3/tower/conv_1"
  top: "mixed_3/tower/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_3/tower/conv_1_relu"
  type: "ReLU"
  bottom: "mixed_3/tower/conv_1"
  top: "mixed_3/tower/conv_1"
}
layer {
  name: "mixed_3/tower/conv_2"
  type: "Convolution"
  bottom: "mixed_3/tower/conv_1"
  top: "mixed_3/tower/conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 96
    bias_term: false
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_3/tower/conv_2_bn"
  type: "BatchNorm"
  bottom: "mixed_3/tower/conv_2"
  top: "mixed_3/tower/conv_2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_3/tower/conv_2_bias"
  type: "Bias"
  bottom: "mixed_3/tower/conv_2"
  top: "mixed_3/tower/conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_3/tower/conv_2_relu"
  type: "ReLU"
  bottom: "mixed_3/tower/conv_2"
  top: "mixed_3/tower/conv_2"
}
layer {
  name: "mixed_3/pool"
  type: "Pooling"
  bottom: "mixed_2/join"
  top: "mixed_3/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "mixed_3/join"
  type: "Concat"
  bottom: "mixed_3/conv"
  bottom: "mixed_3/tower/conv_2"
  bottom: "mixed_3/pool"
  top: "mixed_3/join"
  concat_param {
    axis: 1
  }
}
layer {
  name: "mixed_4/conv"
  type: "Convolution"
  bottom: "mixed_3/join"
  top: "mixed_4/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_4/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_4/conv"
  top: "mixed_4/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_4/conv_bias"
  type: "Bias"
  bottom: "mixed_4/conv"
  top: "mixed_4/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_4/conv_relu"
  type: "ReLU"
  bottom: "mixed_4/conv"
  top: "mixed_4/conv"
}
layer {
  name: "mixed_4/tower/conv"
  type: "Convolution"
  bottom: "mixed_3/join"
  top: "mixed_4/tower/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_4/tower/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_4/tower/conv"
  top: "mixed_4/tower/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_4/tower/conv_bias"
  type: "Bias"
  bottom: "mixed_4/tower/conv"
  top: "mixed_4/tower/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_4/tower/conv_relu"
  type: "ReLU"
  bottom: "mixed_4/tower/conv"
  top: "mixed_4/tower/conv"
}
layer {
  name: "mixed_4/tower/conv_1"
  type: "Convolution"
  bottom: "mixed_4/tower/conv"
  top: "mixed_4/tower/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "mixed_4/tower/conv_1_bn"
  type: "BatchNorm"
  bottom: "mixed_4/tower/conv_1"
  top: "mixed_4/tower/conv_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_4/tower/conv_1_bias"
  type: "Bias"
  bottom: "mixed_4/tower/conv_1"
  top: "mixed_4/tower/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_4/tower/conv_1_relu"
  type: "ReLU"
  bottom: "mixed_4/tower/conv_1"
  top: "mixed_4/tower/conv_1"
}
layer {
  name: "mixed_4/tower/conv_2"
  type: "Convolution"
  bottom: "mixed_4/tower/conv_1"
  top: "mixed_4/tower/conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "mixed_4/tower/conv_2_bn"
  type: "BatchNorm"
  bottom: "mixed_4/tower/conv_2"
  top: "mixed_4/tower/conv_2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_4/tower/conv_2_bias"
  type: "Bias"
  bottom: "mixed_4/tower/conv_2"
  top: "mixed_4/tower/conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_4/tower/conv_2_relu"
  type: "ReLU"
  bottom: "mixed_4/tower/conv_2"
  top: "mixed_4/tower/conv_2"
}
layer {
  name: "mixed_4/tower_1/conv"
  type: "Convolution"
  bottom: "mixed_3/join"
  top: "mixed_4/tower_1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_4/tower_1/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_4/tower_1/conv"
  top: "mixed_4/tower_1/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_4/tower_1/conv_bias"
  type: "Bias"
  bottom: "mixed_4/tower_1/conv"
  top: "mixed_4/tower_1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_4/tower_1/conv_relu"
  type: "ReLU"
  bottom: "mixed_4/tower_1/conv"
  top: "mixed_4/tower_1/conv"
}
layer {
  name: "mixed_4/tower_1/conv_1"
  type: "Convolution"
  bottom: "mixed_4/tower_1/conv"
  top: "mixed_4/tower_1/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "mixed_4/tower_1/conv_1_bn"
  type: "BatchNorm"
  bottom: "mixed_4/tower_1/conv_1"
  top: "mixed_4/tower_1/conv_1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_4/tower_1/conv_1_bias"
  type: "Bias"
  bottom: "mixed_4/tower_1/conv_1"
  top: "mixed_4/tower_1/conv_1"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_4/tower_1/conv_1_relu"
  type: "ReLU"
  bottom: "mixed_4/tower_1/conv_1"
  top: "mixed_4/tower_1/conv_1"
}
layer {
  name: "mixed_4/tower_1/conv_2"
  type: "Convolution"
  bottom: "mixed_4/tower_1/conv_1"
  top: "mixed_4/tower_1/conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "mixed_4/tower_1/conv_2_bn"
  type: "BatchNorm"
  bottom: "mixed_4/tower_1/conv_2"
  top: "mixed_4/tower_1/conv_2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_4/tower_1/conv_2_bias"
  type: "Bias"
  bottom: "mixed_4/tower_1/conv_2"
  top: "mixed_4/tower_1/conv_2"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_4/tower_1/conv_2_relu"
  type: "ReLU"
  bottom: "mixed_4/tower_1/conv_2"
  top: "mixed_4/tower_1/conv_2"
}
layer {
  name: "mixed_4/tower_1/conv_3"
  type: "Convolution"
  bottom: "mixed_4/tower_1/conv_2"
  top: "mixed_4/tower_1/conv_3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "mixed_4/tower_1/conv_3_bn"
  type: "BatchNorm"
  bottom: "mixed_4/tower_1/conv_3"
  top: "mixed_4/tower_1/conv_3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_4/tower_1/conv_3_bias"
  type: "Bias"
  bottom: "mixed_4/tower_1/conv_3"
  top: "mixed_4/tower_1/conv_3"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_4/tower_1/conv_3_relu"
  type: "ReLU"
  bottom: "mixed_4/tower_1/conv_3"
  top: "mixed_4/tower_1/conv_3"
}
layer {
  name: "mixed_4/tower_1/conv_4"
  type: "Convolution"
  bottom: "mixed_4/tower_1/conv_3"
  top: "mixed_4/tower_1/conv_4"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride_h: 1
    stride_w: 1
  }
}
layer {
  name: "mixed_4/tower_1/conv_4_bn"
  type: "BatchNorm"
  bottom: "mixed_4/tower_1/conv_4"
  top: "mixed_4/tower_1/conv_4"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_4/tower_1/conv_4_bias"
  type: "Bias"
  bottom: "mixed_4/tower_1/conv_4"
  top: "mixed_4/tower_1/conv_4"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_4/tower_1/conv_4_relu"
  type: "ReLU"
  bottom: "mixed_4/tower_1/conv_4"
  top: "mixed_4/tower_1/conv_4"
}
layer {
  name: "mixed_4/tower_2/pool"
  type: "Pooling"
  bottom: "mixed_3/join"
  top: "mixed_4/tower_2/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "mixed_4/tower_2/conv"
  type: "Convolution"
  bottom: "mixed_4/tower_2/pool"
  top: "mixed_4/tower_2/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_4/tower_2/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_4/tower_2/conv"
  top: "mixed_4/tower_2/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_4/tower_2/conv_bias"
  type: "Bias"
  bottom: "mixed_4/tower_2/conv"
  top: "mixed_4/tower_2/conv"
  param {
    lr_mult: 1.0
    decay_mult: 0.0
  }
  bias_param {
    filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "mixed_4/tower_2/conv_relu"
  type: "ReLU"
  bottom: "mixed_4/tower_2/conv"
  top: "mixed_4/tower_2/conv"
}
layer {
  name: "mixed_4/join"
  type: "Concat"
  bottom: "mixed_4/conv"
  bottom: "mixed_4/tower/conv_2"
  bottom: "mixed_4/tower_1/conv_4"
  bottom: "mixed_4/tower_2/conv"
  top: "mixed_4/join"
  concat_param {
    axis: 1
  }
}
layer {
  name: "mixed_5/conv"
  type: "Convolution"
  bottom: "mixed_4/join"
  top: "mixed_5/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 192
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.009999999776482582
    }
  }
}
layer {
  name: "mixed_5/conv_bn"
  type: "BatchNorm"
  bottom: "mixed_5/conv"
  top: "mixed_5/conv"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.9990000128746033
    eps: 0.0010000000474974513
  }
}
layer {
  name: "mixed_5/conv_bias"
  type: "Bias"
  bottom: "mixed_5/conv"
  top: "mixed_5/conv"
